In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

Q.1 Load Dataset and display first 10 rows

In [845]:
df = pd.read_csv("C:\\Users\\karan\\Downloads\\Employe_Performance_dataset.csv")

In [847]:
df.head(10)

,ID,Name,Age,Gender,Department,Salary,Joining Date,Performance Score,Experience,Status,Location,Session
0,1,Cory Escobar,48,Female,HR,5641,2015-05-03,2.0,16,Active,New York,Night
1,2,Timothy Sanchez,25,Other,Sales,4249,2020-11-09,2.0,11,Inactive,Los Angeles,Evening
2,3,Chad Nichols,57,Other,Sales,3058,2019-02-12,NaN,1,Inactive,New York,Morning
3,4,Christine Williams,58,Female,IT,5895,2017-09-08,2.0,13,Inactive,Los Angeles,Evening
4,5,Amber Harris,35,Other,IT,4317,2020-02-15,5.0,16,Inactive,New York,Evening
5,6,Ashley Howe,29,Female,HR,2591,2016-06-24,1.0,6,Active,Chicago,Evening
6,7,David Olson,39,Female,Sales,6826,2023-05-11,NaN,4,Active,New York,Night
7,8,Amanda Baker,52,Other,HR,6285,2015-04-01,NaN,8,Inactive,Chicago,Evening
8,9,Jeremy Wright,63,Female,Sales,9862,2024-02-07,NaN,3,Inactive,New York,Night
9,10,Brian Faulkner,30,Male,IT,8202,2018-05-26,1.0,9,Active,Los Angeles,Morning

Q.2 What are the column names and their respective data types in the dataset?

In [850]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   ID                 1000 non-null   int64
 1   Name               1000 non-null   object
 2   Age                1000 non-null   int64
 3   Gender             1000 non-null   object
 4   Department         1000 non-null   object
 5   Salary             1000 non-null   int64
 6   Joining Date       1000 non-null   object
 7   Performance Score  502 non-null    float64
 8   Experience         1000 non-null   int64
 9   Status             1000 non-null   object
 10  Location           1000 non-null   object
 11  Session            1000 non-null   object
dtypes: float64(1), int64(4), object(7)
memory usage: 93.9+ KB

Q.3  How many rows and columns are there in the dataset?

In [853]:
df.shape

(1000, 12)

Q.4 Select the Name, Age, and Salary columns using df[]

In [856]:
df[['Name', 'Age', 'Salary']].head()

                 Name  Age  Salary
0        Cory Escobar   48    5641
1     Timothy Sanchez   25    4249
2        Chad Nichols   57    3058
3  Christine Williams   58    5895
4        Amber Harris   35    4317

Q.5 Select the first 5 rows of the DataFrame using the iloc method.

In [859]:
df.iloc[:5]

,ID,Name,Age,Gender,Department,Salary,Joining Date,Performance Score,Experience,Status,Location,Session
0,1,Cory Escobar,48,Female,HR,5641,2015-05-03,2.0,16,Active,New York,Night
1,2,Timothy Sanchez,25,Other,Sales,4249,2020-11-09,2.0,11,Inactive,Los Angeles,Evening
2,3,Chad Nichols,57,Other,Sales,3058,2019-02-12,NaN,1,Inactive,New York,Morning
3,4,Christine Williams,58,Female,IT,5895,2017-09-08,2.0,13,Inactive,Los Angeles,Evening
4,5,Amber Harris,35,Other,IT,4317,2020-02-15,5.0,16,Inactive,New York,Evening

Q.6 Select all rows where the Department is "Sales" using the loc method.

In [862]:
df.loc[df['Department'] == 'Sales']

,ID,Name,Age,Gender,Department,Salary,Joining Date,Performance Score,Experience,Status,Location,Session
1,2,Timothy Sanchez,25,Other,Sales,4249,2020-11-09,2.0,11,Inactive,Los Angeles,Evening
2,3,Chad Nichols,57,Other,Sales,3058,2019-02-12,NaN,1,Inactive,New York,Morning
6,7,David Olson,39,Female,Sales,6826,2023-05-11,NaN,4,Active,New York,Night
8,9,Jeremy Wright,63,Female,Sales,9862,2024-02-07,NaN,3,Inactive,New York,Night
10,11,Nicole Bell,42,Female,Sales,5336,2015-01-28,3.0,7,Active,Los Angeles,Evening
...,...,...,...,...,...,...,...,...,...,...,...,...
991,992,William Schultz,23,Other,Sales,4311,2019-08-17,NaN,10,Inactive,Los Angeles,Evening
992,993,Ashley Daniels,25,Other,Sales,5524,2022-11-24,NaN,8,Inactive,New York,Morning
995,996,Pamela Reeves,49,Female,Sales,7652,2024-06-23,4.0,3,Active,Los Angeles,Evening
996,997,Todd Johnson,29,Female,Sales,6754,2018-07-20,NaN,12,Inactive,New York,Morning
997,998,Michael Sanchez,18,Male,Sales,5278,2023-07-05,5.0,3,Active,New York,Morning

Q.7 Select rows where the Salary is greater than 8000 and Status is "Active".

In [865]:
df.query("Salary > 8000 & Status == 'Active'")

,ID,Name,Age,Gender,Department,Salary,Joining Date,Performance Score,Experience,Status,Location,Session
9,10,Brian Faulkner,30,Male,IT,8202,2018-05-26,1.0,9,Active,Los Angeles,Morning
24,25,Tracy Carlson,21,Male,HR,9275,2022-04-09,4.0,12,Active,New York,Morning
38,39,Jordan Scott,33,Other,Sales,8678,2016-05-15,5.0,9,Active,Los Angeles,Evening
39,40,Lisa Wagner,36,Male,HR,8870,2024-08-12,4.0,17,Active,Los Angeles,Evening
60,61,Andrew Shannon,51,Other,Sales,8544,2020-02-08,NaN,6,Active,New York,Evening
...,...,...,...,...,...,...,...,...,...,...,...,...
976,977,Kimberly Ross,19,Male,Sales,9331,2018-07-03,5.0,12,Active,New York,Morning
982,983,Stephen Ponce,46,Other,Sales,8696,2022-10-14,4.0,1,Active,New York,Evening
986,987,Melissa Bradley,39,Female,IT,9618,2015-07-05,1.0,13,Active,New York,Morning
988,989,Hannah Hickman,36,Female,IT,9118,2022-07-02,5.0,5,Active,New York,Night
989,990,Shannon Meyer,18,Other,HR,9985,2022-11-05,4.0,18,Active,Chicago,Night

Renaming columns names

In [868]:
df = df.rename(columns = {"Performance Score" : "Performance_score", "Joining Date" : "Joining_date"})
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   ID                 1000 non-null   int64
 1   Name               1000 non-null   object
 2   Age                1000 non-null   int64
 3   Gender             1000 non-null   object
 4   Department         1000 non-null   object
 5   Salary             1000 non-null   int64
 6   Joining_date       1000 non-null   object
 7   Performance_score  502 non-null    float64
 8   Experience         1000 non-null   int64
 9   Status             1000 non-null   object
 10  Location           1000 non-null   object
 11  Session            1000 non-null   object
dtypes: float64(1), int64(4), object(7)
memory usage: 93.9+ KB

Q.8 Extract the rows where the employee has been with the company for more than 5 years and has a 
Performance Score of at least 4.

In [871]:
df_1 = df.query("Experience > 5 & Performance_score >= 4")
df_1

,ID,Name,Age,Gender,Department,Salary,Joining_date,Performance_score,Experience,Status,Location,Session
4,5,Amber Harris,35,Other,IT,4317,2020-02-15,5.0,16,Inactive,New York,Evening
11,12,Rodney Richardson,60,Other,HR,6908,2015-03-14,4.0,19,Active,Chicago,Night
17,18,Jacqueline Randall,31,Female,HR,3519,2018-05-18,4.0,6,Active,New York,Morning
18,19,Nancy Stephens,38,Male,HR,9061,2017-07-16,5.0,16,Inactive,Chicago,Night
24,25,Tracy Carlson,21,Male,HR,9275,2022-04-09,4.0,12,Active,New York,Morning
...,...,...,...,...,...,...,...,...,...,...,...,...
978,979,Michael Lee,18,Female,IT,6086,2019-05-30,4.0,7,Inactive,Los Angeles,Evening
989,990,Shannon Meyer,18,Other,HR,9985,2022-11-05,4.0,18,Active,Chicago,Night
990,991,Amy Johnston,53,Female,HR,3991,2024-09-03,4.0,8,Active,Chicago,Morning
993,994,Brandon Bruce,31,Female,HR,3371,2018-09-25,5.0,12,Inactive,Chicago,Night
998,999,Ashley Taylor,51,Female,IT,5437,2022-02-18,4.0,9,Inactive,Los Angeles,Evening

Q.9 Select every alternate row from the DataFrame using slicing with iloc.

In [874]:
df.iloc[::2]

,ID,Name,Age,Gender,Department,Salary,Joining_date,Performance_score,Experience,Status,Location,Session
0,1,Cory Escobar,48,Female,HR,5641,2015-05-03,2.0,16,Active,New York,Night
2,3,Chad Nichols,57,Other,Sales,3058,2019-02-12,NaN,1,Inactive,New York,Morning
4,5,Amber Harris,35,Other,IT,4317,2020-02-15,5.0,16,Inactive,New York,Evening
6,7,David Olson,39,Female,Sales,6826,2023-05-11,NaN,4,Active,New York,Night
8,9,Jeremy Wright,63,Female,Sales,9862,2024-02-07,NaN,3,Inactive,New York,Night
...,...,...,...,...,...,...,...,...,...,...,...,...
990,991,Amy Johnston,53,Female,HR,3991,2024-09-03,4.0,8,Active,Chicago,Morning
992,993,Ashley Daniels,25,Other,Sales,5524,2022-11-24,NaN,8,Inactive,New York,Morning
994,995,Rachel Phillips,22,Male,IT,3096,2018-10-27,2.0,7,Inactive,Chicago,Evening
996,997,Todd Johnson,29,Female,Sales,6754,2018-07-20,NaN,12,Inactive,New York,Morning
998,999,Ashley Taylor,51,Female,IT,5437,2022-02-18,4.0,9,Inactive,Los Angeles,Evening

Q.10  Retrieve rows where the employee belongs to "Sales" and has a Salary in the top 10% of all salaries.

In [877]:
top10 = df["Salary"].quantile(0.90)
mask = "Department == 'Sales' & Salary >= @top10"
df.query(mask)

,ID,Name,Age,Gender,Department,Salary,Joining_date,Performance_score,Experience,Status,Location,Session
8,9,Jeremy Wright,63,Female,Sales,9862,2024-02-07,NaN,3,Inactive,New York,Night
22,23,Bryce Carter,35,Female,Sales,9598,2015-12-16,4.0,4,Inactive,New York,Night
29,30,Rachel Ramsey,22,Male,Sales,9661,2016-08-18,2.0,17,Inactive,Chicago,Night
215,216,Sara Jones,50,Female,Sales,9377,2019-10-16,NaN,3,Active,Los Angeles,Morning
228,229,Christie Warren,51,Female,Sales,9139,2020-08-16,5.0,1,Active,Chicago,Night
239,240,Christina Gutierrez,37,Male,Sales,9356,2018-01-02,3.0,3,Active,Chicago,Morning
250,251,Joshua Bullock,38,Male,Sales,9924,2019-01-10,4.0,20,Inactive,Chicago,Night
263,264,Gabriela Wilson,40,Other,Sales,9455,2023-11-19,1.0,14,Active,Los Angeles,Morning
275,276,Harry Alexander,22,Male,Sales,9749,2019-05-15,NaN,5,Active,Los Angeles,Morning
299,300,Terry Smith,38,Female,Sales,9375,2022-12-23,NaN,2,Inactive,New York,Morning
379,380,Dustin Le,29,Male,Sales,9726,2015-04-13,1.0,2,Inactive,Chicago,Evening
381,382,David Marshall,43,Other,Sales,9269,2018-10-05,2.0,13,Inactive,Los Angeles,Evening
405,406,Heather Scott,57,Male,Sales,9505,2024-08-18,3.0,6,Inactive,New York,Night
442,443,Kimberly Sparks,26,Other,Sales,9146,2024-07-29,3.0,3,Inactive,New York,Evening
491,492,Dr. Jacob Castaneda DVM,53,Other,Sales,9181,2024-02-17,5.0,1,Inactive,Los Angeles,Morning
516,517,Christina Lowe,35,Female,Sales,9630,2018-07-03,NaN,1,Active,Los Angeles,Night
552,553,Amanda Griffith,26,Male,Sales,9704,2019-05-30,NaN,9,Active,New York,Evening
591,592,Jonathan Rangel,49,Other,Sales,9323,2021-01-19,NaN,18,Inactive,Chicago,Evening
594,595,Michelle Smith,35,Other,Sales,9906,2018-12-18,NaN,9,Active,Los Angeles,Evening
629,630,Patricia Scott,52,Other,Sales,9364,2019-11-05,NaN,5,Active,New York,Evening
742,743,Timothy Guzman,41,Female,Sales,9409,2023-09-17,NaN,16,Inactive,New York,Morning
756,757,James James,38,Male,Sales,9666,2016-04-14,NaN,15,Active,Los Angeles,Morning
758,759,Matthew Roberts,53,Male,Sales,9917,2017-07-07,1.0,16,Active,Los Angeles,Evening
778,779,David Nelson,39,Other,Sales,9653,2021-08-08,NaN,19,Inactive,New York,Morning
796,797,Jacob Shannon,35,Other,Sales,9926,2016-09-04,NaN,7,Active,Chicago,Night
844,845,Gerald Cooke,33,Other,Sales,9693,2017-08-29,NaN,17,Inactive,New York,Morning
898,899,Tiffany Jordan,44,Male,Sales,9819,2022-07-15,NaN,13,Active,New York,Morning
903,904,Leslie Mason,42,Other,Sales,9658,2019-10-31,1.0,14,Inactive,New York,Evening
932,933,Kristin Cole,50,Male,Sales,9616,2017-02-03,2.0,13,Inactive,Los Angeles,Night
937,938,Gary Mitchell,52,Female,Sales,9963,2016-09-22,5.0,20,Inactive,Los Angeles,Morning
976,977,Kimberly Ross,19,Male,Sales,9331,2018-07-03,5.0,12,Active,New York,Morning

Q.11  Replace all "Inactive" values in the Status column with "Retired"

In [880]:
df.loc[df["Status"] == 'Inactive', "Status"] = "Retired"
df.head()

,ID,Name,Age,Gender,Department,Salary,Joining_date,Performance_score,Experience,Status,Location,Session
0,1,Cory Escobar,48,Female,HR,5641,2015-05-03,2.0,16,Active,New York,Night
1,2,Timothy Sanchez,25,Other,Sales,4249,2020-11-09,2.0,11,Retired,Los Angeles,Evening
2,3,Chad Nichols,57,Other,Sales,3058,2019-02-12,NaN,1,Retired,New York,Morning
3,4,Christine Williams,58,Female,IT,5895,2017-09-08,2.0,13,Retired,Los Angeles,Evening
4,5,Amber Harris,35,Other,IT,4317,2020-02-15,5.0,16,Retired,New York,Evening

Q.12 Add a new column Bonus where values are 10% of the Salary column.

In [883]:
df["Bonus"] = df["Salary"] * 0.1
df.head()

,ID,Name,Age,Gender,Department,Salary,Joining_date,Performance_score,Experience,Status,Location,Session,Bonus
0,1,Cory Escobar,48,Female,HR,5641,2015-05-03,2.0,16,Active,New York,Night,564.1
1,2,Timothy Sanchez,25,Other,Sales,4249,2020-11-09,2.0,11,Retired,Los Angeles,Evening,424.9
2,3,Chad Nichols,57,Other,Sales,3058,2019-02-12,NaN,1,Retired,New York,Morning,305.8
3,4,Christine Williams,58,Female,IT,5895,2017-09-08,2.0,13,Retired,Los Angeles,Evening,589.5
4,5,Amber Harris,35,Other,IT,4317,2020-02-15,5.0,16,Retired,New York,Evening,431.7

Q.13  Update the Performance Score of employees in the "IT" department to 5 if it is NaN

In [886]:
df.loc[(df["Department"] == "IT") & (df["Performance_score"] == None), "Performance_score"] = 5
df.query("Department == 'IT'")

,ID,Name,Age,Gender,Department,Salary,Joining_date,Performance_score,Experience,Status,Location,Session,Bonus
3,4,Christine Williams,58,Female,IT,5895,2017-09-08,2.0,13,Retired,Los Angeles,Evening,589.5
4,5,Amber Harris,35,Other,IT,4317,2020-02-15,5.0,16,Retired,New York,Evening,431.7
9,10,Brian Faulkner,30,Male,IT,8202,2018-05-26,1.0,9,Active,Los Angeles,Morning,820.2
12,13,Joshua Robinson,61,Male,IT,5688,2020-06-21,NaN,4,Retired,Chicago,Night,568.8
13,14,Benjamin Callahan,34,Male,IT,5593,2019-06-23,NaN,2,Retired,Los Angeles,Night,559.3
...,...,...,...,...,...,...,...,...,...,...,...,...,...
987,988,Danielle Brown,31,Female,IT,5605,2024-06-28,NaN,1,Active,Chicago,Morning,560.5
988,989,Hannah Hickman,36,Female,IT,9118,2022-07-02,5.0,5,Active,New York,Night,911.8
994,995,Rachel Phillips,22,Male,IT,3096,2018-10-27,2.0,7,Retired,Chicago,Evening,309.6
998,999,Ashley Taylor,51,Female,IT,5437,2022-02-18,4.0,9,Retired,Los Angeles,Evening,543.7
999,1000,Shawn Scott,45,Male,IT,7364,2022-07-31,2.0,4,Active,New York,Morning,736.4

Q.14  Modify the Experience of employees with less than 2 years to 2

In [889]:
mask = df["Experience"] < 2
df.loc[mask, "Experience"] = 2
df

,ID,Name,Age,Gender,Department,Salary,Joining_date,Performance_score,Experience,Status,Location,Session,Bonus
0,1,Cory Escobar,48,Female,HR,5641,2015-05-03,2.0,16,Active,New York,Night,564.1
1,2,Timothy Sanchez,25,Other,Sales,4249,2020-11-09,2.0,11,Retired,Los Angeles,Evening,424.9
2,3,Chad Nichols,57,Other,Sales,3058,2019-02-12,NaN,2,Retired,New York,Morning,305.8
3,4,Christine Williams,58,Female,IT,5895,2017-09-08,2.0,13,Retired,Los Angeles,Evening,589.5
4,5,Amber Harris,35,Other,IT,4317,2020-02-15,5.0,16,Retired,New York,Evening,431.7
...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Pamela Reeves,49,Female,Sales,7652,2024-06-23,4.0,3,Active,Los Angeles,Evening,765.2
996,997,Todd Johnson,29,Female,Sales,6754,2018-07-20,NaN,12,Retired,New York,Morning,675.4
997,998,Michael Sanchez,18,Male,Sales,5278,2023-07-05,5.0,3,Active,New York,Morning,527.8
998,999,Ashley Taylor,51,Female,IT,5437,2022-02-18,4.0,9,Retired,Los Angeles,Evening,543.7
999,1000,Shawn Scott,45,Male,IT,7364,2022-07-31,2.0,4,Active,New York,Morning,736.4

Q.15 Normalize the Salary column so that all values are between 0 and 1.

In [892]:
df["Normalized_salary"] = (df['Salary'] - df['Salary'].min()) / (df['Salary'].max() - df['Salary'].min())
df.head()

,ID,Name,Age,Gender,Department,Salary,Joining_date,Performance_score,Experience,Status,Location,Session,Bonus,Normalized_salary
0,1,Cory Escobar,48,Female,HR,5641,2015-05-03,2.0,16,Active,New York,Night,564.1,0.454500
1,2,Timothy Sanchez,25,Other,Sales,4249,2020-11-09,2.0,11,Retired,Los Angeles,Evening,424.9,0.280020
2,3,Chad Nichols,57,Other,Sales,3058,2019-02-12,NaN,2,Retired,New York,Morning,305.8,0.130735
3,4,Christine Williams,58,Female,IT,5895,2017-09-08,2.0,13,Retired,Los Angeles,Evening,589.5,0.486337
4,5,Amber Harris,35,Other,IT,4317,2020-02-15,5.0,16,Retired,New York,Evening,431.7,0.288543

Q.16 Replace all Location values with "Remote" for employees with a Performance Score below 3.

In [895]:
mask = df['Performance_score'] < 3  
df.loc[mask, 'Location'] = 'Remote'
df.query("Performance_score < 3")

,ID,Name,Age,Gender,Department,Salary,Joining_date,Performance_score,Experience,Status,Location,Session,Bonus,Normalized_salary
0,1,Cory Escobar,48,Female,HR,5641,2015-05-03,2.0,16,Active,Remote,Night,564.1,0.454500
1,2,Timothy Sanchez,25,Other,Sales,4249,2020-11-09,2.0,11,Retired,Remote,Evening,424.9,0.280020
3,4,Christine Williams,58,Female,IT,5895,2017-09-08,2.0,13,Retired,Remote,Evening,589.5,0.486337
5,6,Ashley Howe,29,Female,HR,2591,2016-06-24,1.0,6,Active,Remote,Evening,259.1,0.072199
9,10,Brian Faulkner,30,Male,IT,8202,2018-05-26,1.0,9,Active,Remote,Morning,820.2,0.775508
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
979,980,Crystal Espinoza,55,Female,IT,4952,2023-09-04,2.0,5,Active,Remote,Night,495.2,0.368137
985,986,Regina Ferguson,62,Other,HR,8555,2017-04-21,1.0,14,Retired,Remote,Morning,855.5,0.819754
986,987,Melissa Bradley,39,Female,IT,9618,2015-07-05,1.0,13,Active,Remote,Morning,961.8,0.952996
994,995,Rachel Phillips,22,Male,IT,3096,2018-10-27,2.0,7,Retired,Remote,Evening,309.6,0.135498
999,1000,Shawn Scott,45,Male,IT,7364,2022-07-31,2.0,4,Active,Remote,Morning,736.4,0.670469

Q.17  Create a new column Experience Level with values "Junior", "Mid", or "Senior" based on the 
Experience.

In [898]:
bins = [0, 4, 7, float('inf')]
labels = ['Junior', 'Mid', 'Senior']
df["Experience_level"] = pd.cut(df["Experience"], bins = bins, labels = labels, right = False)
df.head()

,ID,Name,Age,Gender,Department,Salary,Joining_date,Performance_score,Experience,Status,Location,Session,Bonus,Normalized_salary,Experience_level
0,1,Cory Escobar,48,Female,HR,5641,2015-05-03,2.0,16,Active,Remote,Night,564.1,0.454500,Senior
1,2,Timothy Sanchez,25,Other,Sales,4249,2020-11-09,2.0,11,Retired,Remote,Evening,424.9,0.280020,Senior
2,3,Chad Nichols,57,Other,Sales,3058,2019-02-12,NaN,2,Retired,New York,Morning,305.8,0.130735,Junior
3,4,Christine Williams,58,Female,IT,5895,2017-09-08,2.0,13,Retired,Remote,Evening,589.5,0.486337,Senior
4,5,Amber Harris,35,Other,IT,4317,2020-02-15,5.0,16,Retired,New York,Evening,431.7,0.288543,Senior

Q.18  Add a new row with specific values

In [901]:
new_row = {"ID" : len(df) +1, 
           "Name" : "Sandeep Seervi", 
           "Age" : 21,
           "Gender" : "Male",
           "Department" : "IT", 
           "Salary" : 5671, 
           "Joining_date" : '2020-12-10', 
           'Performance_score' : 7,
           "Experience" : 3, 
           "Status" : "Active",
           "Location" : "New York", 
           "Session" : "Morning",
           "Bonus" : 567.1,
           "Normalized_salary" : 0.4545,
           "Experience_level" : "Junior"
          }

df.loc[len(df)] = new_row
df.tail()

,ID,Name,Age,Gender,Department,Salary,Joining_date,Performance_score,Experience,Status,Location,Session,Bonus,Normalized_salary,Experience_level
996,997,Todd Johnson,29,Female,Sales,6754,2018-07-20,NaN,12,Retired,New York,Morning,675.4,0.594009,Senior
997,998,Michael Sanchez,18,Male,Sales,5278,2023-07-05,5.0,3,Active,New York,Morning,527.8,0.409000,Junior
998,999,Ashley Taylor,51,Female,IT,5437,2022-02-18,4.0,9,Retired,Los Angeles,Evening,543.7,0.428930,Senior
999,1000,Shawn Scott,45,Male,IT,7364,2022-07-31,2.0,4,Active,Remote,Morning,736.4,0.670469,Mid
1000,1001,Sandeep Seervi,21,Male,IT,5671,2020-12-10,7.0,3,Active,New York,Morning,567.1,0.454500,Junior

In [903]:
df.convert_dtypes()
df['Joining_date'] = pd.to_datetime(df["Joining_date"])
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1001 entries, 0 to 1000
Data columns (total 15 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   ID                 1001 non-null   int64
 1   Name               1001 non-null   object
 2   Age                1001 non-null   int64
 3   Gender             1001 non-null   object
 4   Department         1001 non-null   object
 5   Salary             1001 non-null   int64
 6   Joining_date       1001 non-null   datetime64[ns]
 7   Performance_score  503 non-null    float64
 8   Experience         1001 non-null   int64
 9   Status             1001 non-null   object
 10  Location           1001 non-null   object
 11  Session            1001 non-null   object
 12  Bonus              1001 non-null   float64
 13  Normalized_salary  1001 non-null   float64
 14  Experience_level   1001 non-null   object
dtypes: datetime64[ns](1), float64(3), int64(4), object(7)
memory usage: 125.1+ KB

Q.19 Delete the column Session from the DataFrame

In [908]:
df_dropses = df.drop('Session', axis = 1)
df_dropses.head()

,ID,Name,Age,Gender,Department,Salary,Joining_date,Performance_score,Experience,Status,Location,Bonus,Normalized_salary,Experience_level
0,1,Cory Escobar,48,Female,HR,5641,2015-05-03,2.0,16,Active,Remote,564.1,0.454500,Senior
1,2,Timothy Sanchez,25,Other,Sales,4249,2020-11-09,2.0,11,Retired,Remote,424.9,0.280020,Senior
2,3,Chad Nichols,57,Other,Sales,3058,2019-02-12,NaN,2,Retired,New York,305.8,0.130735,Junior
3,4,Christine Williams,58,Female,IT,5895,2017-09-08,2.0,13,Retired,Remote,589.5,0.486337,Senior
4,5,Amber Harris,35,Other,IT,4317,2020-02-15,5.0,16,Retired,New York,431.7,0.288543,Senior

Q.20 Delete rows where the Age is greater than 60.

In [911]:
mask = df['Age'] > 60
del_rows = df.loc[mask].index
df = df.drop(del_rows)
df

,ID,Name,Age,Gender,Department,Salary,Joining_date,Performance_score,Experience,Status,Location,Session,Bonus,Normalized_salary,Experience_level
0,1,Cory Escobar,48,Female,HR,5641,2015-05-03,2.0,16,Active,Remote,Night,564.1,0.454500,Senior
1,2,Timothy Sanchez,25,Other,Sales,4249,2020-11-09,2.0,11,Retired,Remote,Evening,424.9,0.280020,Senior
2,3,Chad Nichols,57,Other,Sales,3058,2019-02-12,NaN,2,Retired,New York,Morning,305.8,0.130735,Junior
3,4,Christine Williams,58,Female,IT,5895,2017-09-08,2.0,13,Retired,Remote,Evening,589.5,0.486337,Senior
4,5,Amber Harris,35,Other,IT,4317,2020-02-15,5.0,16,Retired,New York,Evening,431.7,0.288543,Senior
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
996,997,Todd Johnson,29,Female,Sales,6754,2018-07-20,NaN,12,Retired,New York,Morning,675.4,0.594009,Senior
997,998,Michael Sanchez,18,Male,Sales,5278,2023-07-05,5.0,3,Active,New York,Morning,527.8,0.409000,Junior
998,999,Ashley Taylor,51,Female,IT,5437,2022-02-18,4.0,9,Retired,Los Angeles,Evening,543.7,0.428930,Senior
999,1000,Shawn Scott,45,Male,IT,7364,2022-07-31,2.0,4,Active,Remote,Morning,736.4,0.670469,Mid
1000,1001,Sandeep Seervi,21,Male,IT,5671,2020-12-10,7.0,3,Active,New York,Morning,567.1,0.454500,Junior

Q.21  Add a new column Age Group with values "Young", "Middle-aged", or "Senior" based on Age

In [914]:
bins = [0, 27, 41, float('inf')]
labels = ['Young', 'Middle-aged', 'Senior']
df['Age_category'] = pd.cut(df['Age'], bins = bins, labels = labels, right = False)

In [916]:
df.head()

,ID,Name,Age,Gender,Department,Salary,Joining_date,Performance_score,Experience,Status,Location,Session,Bonus,Normalized_salary,Experience_level,Age_category
0,1,Cory Escobar,48,Female,HR,5641,2015-05-03,2.0,16,Active,Remote,Night,564.1,0.454500,Senior,Senior
1,2,Timothy Sanchez,25,Other,Sales,4249,2020-11-09,2.0,11,Retired,Remote,Evening,424.9,0.280020,Senior,Young
2,3,Chad Nichols,57,Other,Sales,3058,2019-02-12,NaN,2,Retired,New York,Morning,305.8,0.130735,Junior,Senior
3,4,Christine Williams,58,Female,IT,5895,2017-09-08,2.0,13,Retired,Remote,Evening,589.5,0.486337,Senior,Senior
4,5,Amber Harris,35,Other,IT,4317,2020-02-15,5.0,16,Retired,New York,Evening,431.7,0.288543,Senior,Middle-aged

Q.22  Identify all columns with missing values using the isna() method

In [919]:
missing_col = list(df.columns[df.isna().any()])
print("Columns with missing values: ", missing_col)

Columns with missing values:  ['Performance_score']

Q.23  Fill the missing values in Performance Score with the average score of that column

In [922]:
df_fill = df.copy()
df_fill = df_fill.fillna({"Performance_score" : df['Performance_score'].mean()})
df_fill

,ID,Name,Age,Gender,Department,Salary,Joining_date,Performance_score,Experience,Status,Location,Session,Bonus,Normalized_salary,Experience_level,Age_category
0,1,Cory Escobar,48,Female,HR,5641,2015-05-03,2.00,16,Active,Remote,Night,564.1,0.454500,Senior,Senior
1,2,Timothy Sanchez,25,Other,Sales,4249,2020-11-09,2.00,11,Retired,Remote,Evening,424.9,0.280020,Senior,Young
2,3,Chad Nichols,57,Other,Sales,3058,2019-02-12,2.92,2,Retired,New York,Morning,305.8,0.130735,Junior,Senior
3,4,Christine Williams,58,Female,IT,5895,2017-09-08,2.00,13,Retired,Remote,Evening,589.5,0.486337,Senior,Senior
4,5,Amber Harris,35,Other,IT,4317,2020-02-15,5.00,16,Retired,New York,Evening,431.7,0.288543,Senior,Middle-aged
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
996,997,Todd Johnson,29,Female,Sales,6754,2018-07-20,2.92,12,Retired,New York,Morning,675.4,0.594009,Senior,Middle-aged
997,998,Michael Sanchez,18,Male,Sales,5278,2023-07-05,5.00,3,Active,New York,Morning,527.8,0.409000,Junior,Young
998,999,Ashley Taylor,51,Female,IT,5437,2022-02-18,4.00,9,Retired,Los Angeles,Evening,543.7,0.428930,Senior,Senior
999,1000,Shawn Scott,45,Male,IT,7364,2022-07-31,2.00,4,Active,Remote,Morning,736.4,0.670469,Mid,Senior
1000,1001,Sandeep Seervi,21,Male,IT,5671,2020-12-10,7.00,3,Active,New York,Morning,567.1,0.454500,Junior,Young

In [924]:
df_fill.isna().sum()

ID                   0
Name                 0
Age                  0
Gender               0
Department           0
Salary               0
Joining_date         0
Performance_score    0
Experience           0
Status               0
Location             0
Session              0
Bonus                0
Normalized_salary    0
Experience_level     0
Age_category         0
dtype: int64

Q.24  Drop all rows with missing values using the dropna() method.

In [927]:
df_drop = df.copy()
df_drop = df_drop.dropna()

In [929]:
df_drop.info()

<class 'pandas.core.frame.DataFrame'>
Index: 450 entries, 0 to 1000
Data columns (total 16 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   ID                 450 non-null    int64
 1   Name               450 non-null    object
 2   Age                450 non-null    int64
 3   Gender             450 non-null    object
 4   Department         450 non-null    object
 5   Salary             450 non-null    int64
 6   Joining_date       450 non-null    datetime64[ns]
 7   Performance_score  450 non-null    float64
 8   Experience         450 non-null    int64
 9   Status             450 non-null    object
 10  Location           450 non-null    object
 11  Session            450 non-null    object
 12  Bonus              450 non-null    float64
 13  Normalized_salary  450 non-null    float64
 14  Experience_level   450 non-null    object
 15  Age_category       450 non-null    category
dtypes: category(1), datetime64[ns](1), float64(3), int64(4), object(7)
memory usage: 56.8+ KB

Q.25  Replace missing values in Performance Score with the median of the scores, grouped by Department

In [932]:
df_ps = df.copy()
df_ps = df_ps.fillna({"Performance_score" : df['Performance_score'].median()})
df_ps.info()

<class 'pandas.core.frame.DataFrame'>
Index: 894 entries, 0 to 1000
Data columns (total 16 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   ID                 894 non-null    int64
 1   Name               894 non-null    object
 2   Age                894 non-null    int64
 3   Gender             894 non-null    object
 4   Department         894 non-null    object
 5   Salary             894 non-null    int64
 6   Joining_date       894 non-null    datetime64[ns]
 7   Performance_score  894 non-null    float64
 8   Experience         894 non-null    int64
 9   Status             894 non-null    object
 10  Location           894 non-null    object
 11  Session            894 non-null    object
 12  Bonus              894 non-null    float64
 13  Normalized_salary  894 non-null    float64
 14  Experience_level   894 non-null    object
 15  Age_category       894 non-null    category
dtypes: category(1), datetime64[ns](1), float64(3), int64(4), object(7)
memory usage: 112.8+ KB

In [934]:
df_ps_group = df.groupby(by = "Department")['Performance_score'].median()
df_ps_group

Department
HR       3.0
IT       3.0
Sales    3.0
Name: Performance_score, dtype: float64

Q.26 Identify rows where the employee is in the "IT" department and their Age is above the average Age 
of "IT" employees

In [937]:
mask1 = "Department == 'IT'"
avg_age = df.query(mask1)['Age'].mean()
mask2 = mask1 + "  & Age > @avg_age"
df.query(mask2).head()

,ID,Name,Age,Gender,Department,Salary,Joining_date,Performance_score,Experience,Status,Location,Session,Bonus,Normalized_salary,Experience_level,Age_category
3,4,Christine Williams,58,Female,IT,5895,2017-09-08,2.0,13,Retired,Remote,Evening,589.5,0.486337,Senior,Senior
33,34,Mr. Brian Nelson,42,Female,IT,5207,2017-08-17,1.0,4,Active,Remote,Night,520.7,0.400100,Mid,Senior
34,35,Lisa Fry,51,Female,IT,9259,2017-09-26,4.0,17,Retired,Los Angeles,Night,925.9,0.907997,Senior,Senior
41,42,Charles Mccall,58,Other,IT,9512,2024-11-10,NaN,8,Retired,Los Angeles,Morning,951.2,0.939709,Senior,Senior
47,48,Jake Johnson,48,Other,IT,5848,2017-02-03,3.0,2,Active,Los Angeles,Night,584.8,0.480446,Junior,Senior

Q.27  Identify rows with duplicate Name and Joining Date combinations, and remove duplicates.

In [940]:
df_join = pd.concat([df, df])
df_join.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1788 entries, 0 to 1000
Data columns (total 16 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   ID                 1788 non-null   int64
 1   Name               1788 non-null   object
 2   Age                1788 non-null   int64
 3   Gender             1788 non-null   object
 4   Department         1788 non-null   object
 5   Salary             1788 non-null   int64
 6   Joining_date       1788 non-null   datetime64[ns]
 7   Performance_score  900 non-null    float64
 8   Experience         1788 non-null   int64
 9   Status             1788 non-null   object
 10  Location           1788 non-null   object
 11  Session            1788 non-null   object
 12  Bonus              1788 non-null   float64
 13  Normalized_salary  1788 non-null   float64
 14  Experience_level   1788 non-null   object
 15  Age_category       1788 non-null   category
dtypes: category(1), datetime64[ns](1), float64(3), int64(4), object(7)
memory usage: 225.4+ KB

In [942]:
df_join.duplicated().sum()

894

In [944]:
df_dup_name = df_join[df_join.duplicated(subset = ['Name', 'Joining_date'])]

In [946]:
df_join = df_join.drop_duplicates(subset = ['Name', 'Joining_date'])

In [948]:
df_join.duplicated(subset = ['Name', 'Joining_date']).sum()

0

Q.28  Remove rows where the Experience value is inconsistent with the Age (e.g., Experience > Age - 18)

In [951]:
mask = 'Experience > Age - 18'
drop_row = df.query(mask).index
df = df.drop(drop_row)
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 660 entries, 0 to 1000
Data columns (total 16 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   ID                 660 non-null    int64
 1   Name               660 non-null    object
 2   Age                660 non-null    int64
 3   Gender             660 non-null    object
 4   Department         660 non-null    object
 5   Salary             660 non-null    int64
 6   Joining_date       660 non-null    datetime64[ns]
 7   Performance_score  339 non-null    float64
 8   Experience         660 non-null    int64
 9   Status             660 non-null    object
 10  Location           660 non-null    object
 11  Session            660 non-null    object
 12  Bonus              660 non-null    float64
 13  Normalized_salary  660 non-null    float64
 14  Experience_level   660 non-null    object
 15  Age_category       660 non-null    category
dtypes: category(1), datetime64[ns](1), float64(3), int64(4), object(7)
memory usage: 83.3+ KB

Q.29 Sort the DataFrame by Salary in descending order.

In [954]:
df.sort_values(by = 'Salary', ascending = False).head()

,ID,Name,Age,Gender,Department,Salary,Joining_date,Performance_score,Experience,Status,Location,Session,Bonus,Normalized_salary,Experience_level,Age_category
811,812,Jesse Miller,52,Male,HR,9993,2020-11-27,NaN,12,Active,Chicago,Evening,999.3,1.000000,Senior,Senior
531,532,Jeffrey Williamson,54,Other,IT,9988,2015-12-08,NaN,16,Retired,Chicago,Evening,998.8,0.999373,Senior,Senior
937,938,Gary Mitchell,52,Female,Sales,9963,2016-09-22,5.0,20,Retired,Los Angeles,Morning,996.3,0.996240,Senior,Senior
908,909,Sara Martinez,34,Other,HR,9951,2024-02-18,NaN,6,Retired,New York,Night,995.1,0.994736,Mid,Middle-aged
120,121,David Hampton,39,Female,HR,9941,2024-07-06,3.0,15,Retired,New York,Morning,994.1,0.993482,Senior,Middle-aged

Q.30 Sort the DataFrame by Department and then by Joining Date in ascending order

In [957]:
df.sort_values(by = ['Department', 'Joining_date']).head()

,ID,Name,Age,Gender,Department,Salary,Joining_date,Performance_score,Experience,Status,Location,Session,Bonus,Normalized_salary,Experience_level,Age_category
514,515,Taylor Williamson,48,Male,HR,9293,2015-03-10,NaN,17,Retired,Chicago,Night,929.3,0.912259,Senior,Senior
11,12,Rodney Richardson,60,Other,HR,6908,2015-03-14,4.0,19,Active,Chicago,Night,690.8,0.613312,Senior,Senior
7,8,Amanda Baker,52,Other,HR,6285,2015-04-01,NaN,8,Retired,Chicago,Evening,628.5,0.535222,Senior,Senior
677,678,Michelle Durham,35,Male,HR,5900,2015-04-25,NaN,12,Active,Chicago,Evening,590.0,0.486964,Senior,Middle-aged
0,1,Cory Escobar,48,Female,HR,5641,2015-05-03,2.0,16,Active,Remote,Night,564.1,0.454500,Senior,Senior

Q.31  Rank all employees by Salary within their Department and add the rank as a new column

In [960]:
df['Salary_Rank'] = df.groupby("Department")['Salary'].rank(ascending = False, method = 'average')

In [962]:
df.head()

,ID,Name,Age,Gender,Department,Salary,Joining_date,Performance_score,Experience,Status,Location,Session,Bonus,Normalized_salary,Experience_level,Age_category,Salary_Rank
0,1,Cory Escobar,48,Female,HR,5641,2015-05-03,2.0,16,Active,Remote,Night,564.1,0.454500,Senior,Senior,114.0
2,3,Chad Nichols,57,Other,Sales,3058,2019-02-12,NaN,2,Retired,New York,Morning,305.8,0.130735,Junior,Senior,191.0
3,4,Christine Williams,58,Female,IT,5895,2017-09-08,2.0,13,Retired,Remote,Evening,589.5,0.486337,Senior,Senior,109.0
4,5,Amber Harris,35,Other,IT,4317,2020-02-15,5.0,16,Retired,New York,Evening,431.7,0.288543,Senior,Middle-aged,160.0
5,6,Ashley Howe,29,Female,HR,2591,2016-06-24,1.0,6,Active,Remote,Evening,259.1,0.072199,Mid,Middle-aged,195.0

Q.32  Sort the dataset by Experience in descending order, but break ties using Performance Score in 
ascending order

In [965]:
df.sort_values(by = ['Experience', 'Performance_score'], ascending = [False, True]).head()

,ID,Name,Age,Gender,Department,Salary,Joining_date,Performance_score,Experience,Status,Location,Session,Bonus,Normalized_salary,Experience_level,Age_category,Salary_Rank
355,356,Laura Castillo,41,Male,IT,2392,2024-03-15,1.0,20,Retired,Remote,Morning,239.2,0.047255,Senior,Senior,213.0
402,403,Briana Martin,59,Male,Sales,4496,2023-05-22,1.0,20,Retired,Remote,Night,449.6,0.310980,Senior,Senior,147.0
538,539,Brandon Church,38,Male,HR,8388,2021-08-02,1.0,20,Retired,Remote,Morning,838.8,0.798822,Senior,Middle-aged,34.0
828,829,Michael Snyder,55,Other,Sales,7497,2024-02-03,1.0,20,Retired,Remote,Morning,749.7,0.687140,Senior,Senior,73.0
529,530,Katie Vega,40,Female,HR,7002,2019-08-06,2.0,20,Active,Remote,Night,700.2,0.625094,Senior,Middle-aged,77.0

Q.33  Create a new DataFrame containing only employees in "HR" with a Salary above 5000

In [968]:
mask = "Department == 'HR' & Salary > 5000"
df_hr = df.query(mask)
df_hr.head()

,ID,Name,Age,Gender,Department,Salary,Joining_date,Performance_score,Experience,Status,Location,Session,Bonus,Normalized_salary,Experience_level,Age_category,Salary_Rank
0,1,Cory Escobar,48,Female,HR,5641,2015-05-03,2.0,16,Active,Remote,Night,564.1,0.454500,Senior,Senior,114.0
7,8,Amanda Baker,52,Other,HR,6285,2015-04-01,NaN,8,Retired,Chicago,Evening,628.5,0.535222,Senior,Senior,103.0
11,12,Rodney Richardson,60,Other,HR,6908,2015-03-14,4.0,19,Active,Chicago,Night,690.8,0.613312,Senior,Senior,81.0
16,17,Jonathan Perez,59,Male,HR,6586,2019-02-19,3.0,7,Retired,Los Angeles,Evening,658.6,0.572951,Senior,Senior,93.0
18,19,Nancy Stephens,38,Male,HR,9061,2017-07-16,5.0,16,Retired,Chicago,Night,906.1,0.883179,Senior,Middle-aged,20.0

Q.34  Filter out all rows where the Location is "Chicago".

In [971]:
mask = "Location == 'Chicago'"
df.query(mask).head()

,ID,Name,Age,Gender,Department,Salary,Joining_date,Performance_score,Experience,Status,Location,Session,Bonus,Normalized_salary,Experience_level,Age_category,Salary_Rank
7,8,Amanda Baker,52,Other,HR,6285,2015-04-01,NaN,8,Retired,Chicago,Evening,628.5,0.535222,Senior,Senior,103.0
11,12,Rodney Richardson,60,Other,HR,6908,2015-03-14,4.0,19,Active,Chicago,Night,690.8,0.613312,Senior,Senior,81.0
18,19,Nancy Stephens,38,Male,HR,9061,2017-07-16,5.0,16,Retired,Chicago,Night,906.1,0.883179,Senior,Middle-aged,20.0
20,21,Heather Jones,35,Male,Sales,4565,2018-02-07,NaN,9,Active,Chicago,Night,456.5,0.319629,Senior,Middle-aged,144.0
55,56,Jonathon Adams,40,Female,IT,8745,2020-07-29,NaN,12,Retired,Chicago,Night,874.5,0.843570,Senior,Middle-aged,38.0

Q.35  Delete all rows where the Performance Score is below 2

In [974]:
mask = df["Performance_score"] < 2
df = df.drop(df.loc[mask].index)
df.head()

,ID,Name,Age,Gender,Department,Salary,Joining_date,Performance_score,Experience,Status,Location,Session,Bonus,Normalized_salary,Experience_level,Age_category,Salary_Rank
0,1,Cory Escobar,48,Female,HR,5641,2015-05-03,2.0,16,Active,Remote,Night,564.1,0.454500,Senior,Senior,114.0
2,3,Chad Nichols,57,Other,Sales,3058,2019-02-12,NaN,2,Retired,New York,Morning,305.8,0.130735,Junior,Senior,191.0
3,4,Christine Williams,58,Female,IT,5895,2017-09-08,2.0,13,Retired,Remote,Evening,589.5,0.486337,Senior,Senior,109.0
4,5,Amber Harris,35,Other,IT,4317,2020-02-15,5.0,16,Retired,New York,Evening,431.7,0.288543,Senior,Middle-aged,160.0
6,7,David Olson,39,Female,Sales,6826,2023-05-11,NaN,4,Active,New York,Night,682.6,0.603033,Mid,Middle-aged,90.0

Q.36  Find the average Salary for each Department.

In [977]:
df_salary_dep = df.groupby(by = "Department").agg({'Salary' : 'mean'}).reset_index()
df_salary_dep

  Department      Salary
0         HR  5955.85000
1         IT  5901.95098
2      Sales  5843.18408

Q.37 Calculate the total Salary of all employees grouped by Status

In [980]:
df_salary_status = df.groupby(by = 'Status')['Salary'].sum().reset_index()
df_salary_status

    Status   Salary
0   Active  1714892
1  Retired  1735639

Q.38 Find the maximum Performance Score for employees in each Location.

In [983]:
df_ps_loc = df.groupby("Location", as_index = False)['Performance_score'].max()
df_ps_loc

      Location  Performance_score
0      Chicago                5.0
1  Los Angeles                5.0
2     New York                7.0
3       Remote                2.0

Q.39 Calculate the total Salary paid to employees who joined in each year

In [986]:
df_salary_year = df.copy()
df_salary_year['Joining_date'] = df_salary_year['Joining_date'].dt.year
df_salary_year = df_salary_year.groupby(by = "Joining_date", as_index = False).agg({"Salary" : 'sum'})
df_salary_year

    Joining_date  Salary
0           2014   15135
1           2015  275743
2           2016  370821
3           2017  313615
4           2018  392152
5           2019  325801
6           2020  365881
7           2021  372695
8           2022  289763
9           2023  423272
10          2024  305653

Q.40   Find the department with the highest average Performance Score

In [989]:
df_ps_dep = df.groupby(by = "Department", as_index = False)['Performance_score'].mean()
max_ps = df_ps_dep['Performance_score'].max()
mask = "Performance_score == @max_ps"
max_dep = df_ps_dep.query(mask)
max_dep

  Department  Performance_score
1         IT            3.45977

Q.41  Count the number of employees in each Location grouped by their Session

In [992]:
df_ses = df.groupby(by = "Session")['Location'].value_counts()
df_ses

Session  Location
Evening  Los Angeles    58
         New York       56
         Chicago        55
         Remote         29
Morning  New York       61
         Chicago        55
         Los Angeles    52
         Remote         26
Night    Los Angeles    61
         Chicago        57
         New York       49
         Remote         26
Name: count, dtype: int64

Q.42 Group employees by Status and calculate the sum, mean, and standard deviation of their Salary

In [997]:
df_status = df.groupby(by = "Status")['Salary'].agg(['sum', 'mean', 'std']).reset_index()
df_status

    Status      sum         mean         std
0   Active  1714892  5872.917808  2314.10243
1  Retired  1735639  5923.682594  2359.37170

Q.43  Use the apply() method to create a new column Monthly Salary by dividing the Salary by 12.

In [1002]:
df_apply = df.copy()

In [1004]:
df_apply['Salary/12'] = df_apply['Salary'].apply(lambda x: x/12)
df_apply.head()

,ID,Name,Age,Gender,Department,Salary,Joining_date,Performance_score,Experience,Status,Location,Session,Bonus,Normalized_salary,Experience_level,Age_category,Salary_Rank,Salary/12
0,1,Cory Escobar,48,Female,HR,5641,2015-05-03,2.0,16,Active,Remote,Night,564.1,0.454500,Senior,Senior,114.0,470.083333
2,3,Chad Nichols,57,Other,Sales,3058,2019-02-12,NaN,2,Retired,New York,Morning,305.8,0.130735,Junior,Senior,191.0,254.833333
3,4,Christine Williams,58,Female,IT,5895,2017-09-08,2.0,13,Retired,Remote,Evening,589.5,0.486337,Senior,Senior,109.0,491.250000
4,5,Amber Harris,35,Other,IT,4317,2020-02-15,5.0,16,Retired,New York,Evening,431.7,0.288543,Senior,Middle-aged,160.0,359.750000
6,7,David Olson,39,Female,Sales,6826,2023-05-11,NaN,4,Active,New York,Night,682.6,0.603033,Mid,Middle-aged,90.0,568.833333

Q.44 Use the applymap() method to convert all string values in the DataFrame to uppercase

In [1007]:
df_map = df.copy()

In [1013]:
df_map = df_map.map(lambda x: x.upper() if isinstance(x, str) else x)
df_map.head()

,ID,Name,Age,Gender,Department,Salary,Joining_date,Performance_score,Experience,Status,Location,Session,Bonus,Normalized_salary,Experience_level,Age_category,Salary_Rank
0,1,CORY ESCOBAR,48,FEMALE,HR,5641,2015-05-03,2.0,16,ACTIVE,REMOTE,NIGHT,564.1,0.454500,SENIOR,SENIOR,114.0
2,3,CHAD NICHOLS,57,OTHER,SALES,3058,2019-02-12,NaN,2,RETIRED,NEW YORK,MORNING,305.8,0.130735,JUNIOR,SENIOR,191.0
3,4,CHRISTINE WILLIAMS,58,FEMALE,IT,5895,2017-09-08,2.0,13,RETIRED,REMOTE,EVENING,589.5,0.486337,SENIOR,SENIOR,109.0
4,5,AMBER HARRIS,35,OTHER,IT,4317,2020-02-15,5.0,16,RETIRED,NEW YORK,EVENING,431.7,0.288543,SENIOR,MIDDLE-AGED,160.0
6,7,DAVID OLSON,39,FEMALE,SALES,6826,2023-05-11,NaN,4,ACTIVE,NEW YORK,NIGHT,682.6,0.603033,MID,MIDDLE-AGED,90.0

Q.45 Create a second dataset containing Department and Budget. Perform an inner join with the original 
dataset.

In [1018]:
df_2 = pd.DataFrame({
    "Department" : ["HR", "IT"],
    "Budget" : [20000, 40000]
})

In [1026]:
df_inner = df.merge(df_2, how = 'inner')
df_inner.head()

,ID,Name,Age,Gender,Department,Salary,Joining_date,Performance_score,Experience,Status,Location,Session,Bonus,Normalized_salary,Experience_level,Age_category,Salary_Rank,Budget
0,1,Cory Escobar,48,Female,HR,5641,2015-05-03,2.0,16,Active,Remote,Night,564.1,0.454500,Senior,Senior,114.0,20000
1,4,Christine Williams,58,Female,IT,5895,2017-09-08,2.0,13,Retired,Remote,Evening,589.5,0.486337,Senior,Senior,109.0,40000
2,5,Amber Harris,35,Other,IT,4317,2020-02-15,5.0,16,Retired,New York,Evening,431.7,0.288543,Senior,Middle-aged,160.0,40000
3,8,Amanda Baker,52,Other,HR,6285,2015-04-01,NaN,8,Retired,Chicago,Evening,628.5,0.535222,Senior,Senior,103.0,20000
4,12,Rodney Richardson,60,Other,HR,6908,2015-03-14,4.0,19,Active,Chicago,Night,690.8,0.613312,Senior,Senior,81.0,20000

Q.46  Merge the dataset with another dataset that includes additional information about employee ID and 
their recent Projects

In [1031]:
df_3 = pd.DataFrame({
    "ID" : [4, 64, 234, 589, 392, 999, 1029, 483],
    "Recent_projects" : ["Project 'A'", "Project 'B'", "Project 'C'", "Project 'D'","Project 'E'", "Project 'F'", "Project 'G'", "Project 'H'"]
})

In [1035]:
df_inner_2 = df.merge(df_3, on = "ID", how = 'inner')
df_inner_2

,ID,Name,Age,Gender,Department,Salary,Joining_date,Performance_score,Experience,Status,Location,Session,Bonus,Normalized_salary,Experience_level,Age_category,Salary_Rank,Recent_projects
0,4,Christine Williams,58,Female,IT,5895,2017-09-08,2.0,13,Retired,Remote,Evening,589.5,0.486337,Senior,Senior,109.0,Project 'A'
1,64,Katherine Clark,39,Female,IT,2585,2023-02-17,2.0,2,Active,Remote,Evening,258.5,0.071446,Junior,Middle-aged,209.0,Project 'B'
2,234,Richard Mendez,40,Male,Sales,7461,2022-04-13,3.0,7,Retired,Chicago,Night,746.1,0.682627,Senior,Middle-aged,74.0,Project 'C'
3,392,Heather Jones,32,Female,HR,6309,2023-03-25,5.0,5,Active,Los Angeles,Evening,630.9,0.538230,Mid,Middle-aged,101.0,Project 'E'
4,483,Curtis Barrett,29,Female,Sales,5215,2021-09-08,NaN,6,Retired,Chicago,Evening,521.5,0.401103,Mid,Middle-aged,129.0,Project 'H'
5,999,Ashley Taylor,51,Female,IT,5437,2022-02-18,4.0,9,Retired,Los Angeles,Evening,543.7,0.428930,Senior,Senior,127.0,Project 'F'

Q.47  Perform a left join with a dataset containing Department and Team Lead details, adding Team Lead 
to the DataFrame.

In [1040]:
df_4 = pd.DataFrame({
    "Department" : ["HR", "IT"],
    "Team_lead" : ["John Smith", "Mary Mosby"]
})

In [1044]:
df_left = df.merge(df_4, on = "Department", how = 'left')
df_left.head()

,ID,Name,Age,Gender,Department,Salary,Joining_date,Performance_score,Experience,Status,Location,Session,Bonus,Normalized_salary,Experience_level,Age_category,Salary_Rank,Team_lead
0,1,Cory Escobar,48,Female,HR,5641,2015-05-03,2.0,16,Active,Remote,Night,564.1,0.454500,Senior,Senior,114.0,John Smith
1,3,Chad Nichols,57,Other,Sales,3058,2019-02-12,NaN,2,Retired,New York,Morning,305.8,0.130735,Junior,Senior,191.0,NaN
2,4,Christine Williams,58,Female,IT,5895,2017-09-08,2.0,13,Retired,Remote,Evening,589.5,0.486337,Senior,Senior,109.0,Mary Mosby
3,5,Amber Harris,35,Other,IT,4317,2020-02-15,5.0,16,Retired,New York,Evening,431.7,0.288543,Senior,Middle-aged,160.0,Mary Mosby
4,7,David Olson,39,Female,Sales,6826,2023-05-11,NaN,4,Active,New York,Night,682.6,0.603033,Mid,Middle-aged,90.0,NaN

Q.48 Create a DataFrame with employee ID and Project Count, then merge it with the original dataset. 
Calculate the average Salary per project.

In [1049]:
df_5 = pd.DataFrame({
    "ID" : [4, 30, 383, 267, 999, 3910],
    "Project_counts" : [40, 30, 25, 42, 29, 35]
})

In [1053]:
df_inner_3 = df.merge(df_5, how = 'inner', on = "ID")
df_inner_3['Avg_salary_per_project'] = df_inner_3['Salary'] / df_inner_3['Project_counts']
df_inner_3

,ID,Name,Age,Gender,Department,Salary,Joining_date,Performance_score,Experience,Status,Location,Session,Bonus,Normalized_salary,Experience_level,Age_category,Salary_Rank,Project_counts,Avg_salary_per_project
0,4,Christine Williams,58,Female,IT,5895,2017-09-08,2.0,13,Retired,Remote,Evening,589.5,0.486337,Senior,Senior,109.0,40,147.375000
1,267,Jared Villanueva,50,Male,IT,5970,2016-06-23,2.0,4,Active,Remote,Morning,597.0,0.495738,Mid,Senior,106.0,42,142.142857
2,383,Kelly Norton,30,Female,IT,7241,2014-12-18,4.0,2,Retired,New York,Morning,724.1,0.655051,Junior,Middle-aged,82.0,25,289.640000
3,999,Ashley Taylor,51,Female,IT,5437,2022-02-18,4.0,9,Retired,Los Angeles,Evening,543.7,0.428930,Senior,Senior,127.0,29,187.482759

Q.49 Calculate the percentage increase in Salary for each employee compared to the average Salary in 
their Department.

In [1072]:
avg_salary = df.groupby("Department", as_index = False)['Salary'].mean()

In [1080]:
avg_salary = avg_salary.rename(columns = {"Salary" : "Average_salary"})
avg_salary

  Department  Average_salary
0         HR      5955.85000
1         IT      5901.95098
2      Sales      5843.18408

In [1086]:
df_avg_salary = df.merge(avg_salary, on = "Department")
df_avg_salary.head()

,ID,Name,Age,Gender,Department,Salary,Joining_date,Performance_score,Experience,Status,Location,Session,Bonus,Normalized_salary,Experience_level,Age_category,Salary_Rank,Average_salary
0,1,Cory Escobar,48,Female,HR,5641,2015-05-03,2.0,16,Active,Remote,Night,564.1,0.454500,Senior,Senior,114.0,5955.85000
1,3,Chad Nichols,57,Other,Sales,3058,2019-02-12,NaN,2,Retired,New York,Morning,305.8,0.130735,Junior,Senior,191.0,5843.18408
2,4,Christine Williams,58,Female,IT,5895,2017-09-08,2.0,13,Retired,Remote,Evening,589.5,0.486337,Senior,Senior,109.0,5901.95098
3,5,Amber Harris,35,Other,IT,4317,2020-02-15,5.0,16,Retired,New York,Evening,431.7,0.288543,Senior,Middle-aged,160.0,5901.95098
4,7,David Olson,39,Female,Sales,6826,2023-05-11,NaN,4,Active,New York,Night,682.6,0.603033,Mid,Middle-aged,90.0,5843.18408

In [1088]:
df_avg_salary['Percent_increase'] = (df_avg_salary['Salary'] - df_avg_salary['Average_salary']) / (df_avg_salary['Average_salary']) * 100

In [1090]:
df_avg_salary.head()

,ID,Name,Age,Gender,Department,Salary,Joining_date,Performance_score,Experience,Status,Location,Session,Bonus,Normalized_salary,Experience_level,Age_category,Salary_Rank,Average_salary,Percent_increase
0,1,Cory Escobar,48,Female,HR,5641,2015-05-03,2.0,16,Active,Remote,Night,564.1,0.454500,Senior,Senior,114.0,5955.85000,-5.286399
1,3,Chad Nichols,57,Other,Sales,3058,2019-02-12,NaN,2,Retired,New York,Morning,305.8,0.130735,Junior,Senior,191.0,5843.18408,-47.665520
2,4,Christine Williams,58,Female,IT,5895,2017-09-08,2.0,13,Retired,Remote,Evening,589.5,0.486337,Senior,Senior,109.0,5901.95098,-0.117774
3,5,Amber Harris,35,Other,IT,4317,2020-02-15,5.0,16,Retired,New York,Evening,431.7,0.288543,Senior,Middle-aged,160.0,5901.95098,-26.854696
4,7,David Olson,39,Female,Sales,6826,2023-05-11,NaN,4,Active,New York,Night,682.6,0.603033,Mid,Middle-aged,90.0,5843.18408,16.819869

Q.50 Print “Thanks”

In [1093]:
print("Thanks")

Thanks